# 함수매핑

## 개별 원소에 함수 매핑

## 시리즈 객체에 함수 매핑

### 예제 6-1. 시리즈 원소에 apply()적용
titanic 데이터셋에서 숫자 데이터로 구성된 2개의 열('age','fare')을 선택하고, 숫자 10만을 원소 값으로 갖는 새로운 열('ten')을 추가한다.

In [4]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age,fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
df['ten']=10
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

apply()메소드를 이용하여 df['age']열에 add_10 함수를 매핑하면 모든 원소에 숫자 10을 더한다. 이 결과를 변수 sr1에 저장한다. add_two_obj
함수를 df['age']열에 매핑하면 함께 전달된 숫자 10을 모든 원소에 더하는데, 결과를 변수 sr2에 저장한다. 마지막으로 lambda함수를 df['age']
열에 매핑하여 add_10 함수의 리턴값을 sr3에 저장한다.

In [5]:
#사용자 함수 정의
def add_10(n):
    return n+10

def add_two_obj(a,b):
    return a+b

#시리즈 객체에 적용
sr1=df['age'].apply(add_10)
print(sr1.head())
print('\n')

#시리즈 객체와 숫자에 적용: 2개의 인수(시리즈+숫자)
sr2=df['age'].apply(add_two_obj, b=10)
print(sr2.head())
print('\n')

#lambda 함수 활용: 시리즈 객체에 적용
sr3=df['age'].apply(lambda x:add_10(x))
print(sr3.head())

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64


0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64


0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

## 데이터프레임 객체에 함수 매핑

### 에졔 6-2. 데이터프레임 원소에 applymap() 적용

In [7]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age,fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
print(df.head())
print('\n')

#사용자 함수 정의
def add_10(n):
    return n+10

#데이터프레임에 applymap()으로 add_10() 함수를 매핑 적용
df_map = df.applymap(add_10)
print(df_map.head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### 예제 6-3. 데이터프레임의 각 여레 함수 매핑

In [8]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age,fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
print(df.head())
print('\n')

#사용자 함수 정의
def missing_value(series):
    return series.isnull()

#데이터프레임의 각 열을 인자로 전달하면 데이터프레임을 반환
result = df.apply(missing_value, axis=0)
print(result.head())
print('\n')
print(type(result))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False


<class 'pandas.core.frame.DataFrame'>

### 예제 6-4. 데이터프레임의 각 열에 함수 매핑

In [9]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age,fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
print(df.head())
print('\n')

#사용자 함수 정의
def min_max(x):
    return x.max()-x.min()

#데이터프레임의 각 열을 인자로 전달하면 데이터프레임을 반환
result = df.apply(min_max) #기본값 axis=0
print(result.head())
print('\n')
print(type(result))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


age      79.5800
fare    512.3292
dtype: float64


<class 'pandas.core.series.Series'>

### 예제 6-5. 데이터프레임에 apply() 적용

In [13]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age,fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
df['ten']=10
print(df.head())
print('\n')

#사용자 함수 정의
def add_two_obj(a,b):
    return a+b

#데이터프레임의 2개의 열을 선택하여 적용
#x=df, a=df['age'], b=df['ten']
df['age']=df.apply(lambda x:add_two_obj(x['age'],x['ten']),axis=1)
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10


    age     fare  ten
0  32.0   7.2500   10
1  48.0  71.2833   10
2  36.0   7.9250   10
3  45.0  53.1000   10
4  45.0   8.0500   10

### 예제 6-6. 데이터프레임에 pipe() 적용

In [19]:
# 라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋에서 age, fare 2개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]

#각 열의 NAN 찾기 - 데이터프레임 전달하면 데이터프레임 반환
def missing_value(x):
    return x.isnull()

#각 열의 NAN 개수 반환 - 데이터프레임 전달하면 시리즈 반환
def missing_count(x):
    return missing_value(x).sum()

#데이터프레임의 총 NAN 개수 - 데이터프레임 전달하면 값 반환
def total_number_missing(x):
    return missing_count(x).sum()

#데이터프레임에 pipe() 메소드로 함수 매핑
result_df=df.pipe(missing_value)
print(result_df.head())
print('\n')

result_series=df.pipe(missing_count)
print(result_series.head())
print('\n')

result_value=df.pipe(total_number_missing)
print(result_value)
print('\n')

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False


age     177
fare      0
dtype: int64


177

# 열 재구성

## 열 순서 변경

### 예제 6-7. 열 순서 바꾸기

In [21]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋의 부분을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df = titanic.loc[0:4,'survived':'age']
print(df,'\n')

#열 이름의 리스트 만들기
columns = list(df.columns.values)
print(columns, '\n')

#열 이름을 알파벳 순으로 정렬하기
columns_sorted = sorted(columns)
df_sorted = df[columns_sorted]
print(df_sorted,'\n')

#열 이름을 기존 순서의 정반대 역순으로 정렬하기
columns_reversed = list(reversed(columns))
df_reversed = df[columns_reversed]
print(df_reversed,'\n')

#열 이름을 사용자가 정의한 임의의 순서로 재배치하기
columns_customed=['pclass','sex','age','survived']
df_customed =df[columns_customed]
print(df_customed)

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

['survived', 'pclass', 'sex', 'age']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

## 열 분리

### 예제6-8. 열 분리하기

In [27]:
#라이브러리 불러오기
import pandas as pd

#데이터셋 가져오기
df = pd.read_excel('주가데이터.xlsx')
print(df.head(),'\n')
print(df.dtypes,'\n')

#연,월,일 데이터 분리하기
df['연월일']=df['연월일'].astype('str')
dates=df['연월일'].str.split('-')
print(dates.head(),'\n')

#분리된 정보를 각각 새로운 열에 담아 df에 추가하기
df['연']=dates.str.get(0)
df['월']=dates.str.get(1)
df['일']=dates.str.get(2)
print(df.head())

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

          연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0  2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26

# 필터링

## 불린 인덱싱

## 예제 6-9. 불린 인덱싱

In [29]:
#라이브러리 불러오기
import seaborn as sns

#titanic 데이터셋 로딩
titanic=sns.load_dataset('titanic')

#나이가 10대(10~19세)인 승객만 따로 선택
mask1=(titanic.age>=10)&(titanic.age<20)
df_teenage = titanic.loc[mask1,:]
print(df_teenage.head())

#나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
mask2=(titanic.age<10)&(titanic.sex=='female')
df_female_under10=titanic.loc[mask2,:]
print(df_female_under10.head())

#나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택
mask3=(titanic.age<10)&(titanic.age>=60)
df_under10_morethan60=titanic.loc[mask3,['age','sex','alone']]
print(df_under10_morethan60.head())

    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False
     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
10          1       3  female  4.0      1      1  16.7000        S   Third
24          0       3  female  8.0      3      1  21.0750        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
58          1       2  female  5.0      1      2  27.7500        S  Second
119         0       3  female  2.0      4      2  31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False
Empty DataFrame
Columns: [age, sex, alone]
Index: []

# 데이터프레임 합치기

## 데이터프레임 연결

### 예제 6-11. 데이터프레임 연결(concatenate)

In [33]:
#라이브러리 불러오기
import pandas as pd

#데이터프레임 만들기
df1 = pd.DataFrame({'a':['a0','a1','a2','a3'],
                    'b':['b0','b1','b2','b3'],
                    'c':['c0','c1','c2','c3']},index=[0,1,2,3])
df2 = pd.DataFrame({'a':['a2','a3','a4','a5'],
                    'b':['b2','b3','b4','b5'],
                    'c':['c2','c3','c4','c5'],
                    'd':['d2','d3','d4','d5']},index=[2,3,4,5])

print(df1,'\n')
print(df2,'\n')

#2개의 데이터프레임을 위 아래 행 방향으로 이어 붙이듯 연결하기
result1 = pd.concat([df1,df2])
print(result1, '\n')

#ignore_index=True 옵션 설정하기
result2 = pd.concat([df1,df2],ignore_index=True)
print(result2, '\n')

#2개의 데이터프레임을 좌우 열 방향으로 이어 붙이듯 연결하기
result3 = pd.concat([df1,df2],axis=1)
print(result3,'\n')

#join='inner'옵션 적용하기(교집합)
result3_in=pd.concat([df1,df2],axis=1,join='inner')
print(result3_in, '\n')

#시리즈 만들기
sr1=pd.Series(['e0','e1','e2','e3'],name='e')
sr2=pd.Series(['f0','f1','f2'],name='f',index=[3,4,5])
sr3=pd.Series(['g0','g1','g2','g3'],name='g')

#df1과 sr1을 좌우 열 방향으로 연결하기
result4=pd.concat([df1,sr1],axis=1)
print(result4,'\n')

#df2과 sr2을 좌우 열 방향으로 연결하기
result5=pd.concat([df2,sr2],axis=1,sort=True)
print(result5,'\n')

#sr1과 sr3을 좌우 열 방향으로 연결하기
result6=pd.concat([sr1,sr3],axis=1)
print(result6,'\n')

result7=pd.concat([sr1,sr3],axis=0)
print(result7,'\n')

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object

# 그룹 연산

## 그룹 객체 만들기(분할 단계)

### 예제 6-14. 그룹 연산-분할

In [41]:
#라이브러리 불러오기
import pandas as pd
import seaborn as sns

#titanic 데이터셋에서 age,sex 등 5개 열을 선택 데이터프레임 만드릭
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','sex','class','fare','survived']]

print('승객 수:',len(df))
print(df.head())
print('\n')

#class 열을 기준으로 분할
grouped=df.groupby(['class'])
print(grouped)

print('******************')
#그룹 객체를 iteration으로 출력: head() 메소드로 첫 5행만을 출력
for key,group in grouped:
    print('* key:',key)
    print('* number:',len(group))
    print(group.head)
    print('\n')
    
#연산 메소드 적용
average = grouped.mean()
print(average)

#개별 그룹 선택하기
group3=grouped.get_group('Third')
print(group3.head())

#class 열, sex열을 기준으로 분할
grouped_two=df.groupby(['class','sex'])

#grouped_two 그룹 객체를 iteration으로 출력
for key,group in grouped_two:
    print('* key:',key)
    print('* number:',len(group))
    print(group.head)
    print('\n')
    
#grouped_two 그룹 객체에 연산 메소드 적용
average_two=grouped_two.mean()
print(average_two)
print('\n')
print(type(average_two))

#grouped_two 그룹 객체에서 개별 그룹 선택하기
grounp3f=grouped_two.get_group(('Third','female'))
print(group3f.head())

승객 수: 891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E18C141490>
******************
* key: First
* number: 216
<bound method NDFrame.head of       age     sex  class     fare  survived
1    38.0  female  First  71.2833         1
3    35.0  female  First  53.1000         1
6    54.0    male  First  51.8625         0
11   58.0  female  First  26.5500         1
23   28.0    male  First  35.5000         1
..    ...     ...    ...      ...       ...
871  47.0  female  First  52.5542         1
872  33.0    male  First   5.0000         0
879  56.0  female  First  83.1583         1
887  19.0  female  First  30.0000         1
889  26.0    male  First  30.0000         1

[216 rows x 5 columns]>


* key: Second
* number: 184
<bound method NDFrame.head of       age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
17    NaN    male  Second  13.0000         1
20   35.0    male  Second  26.0000         0
21   34.0    male  Second  13.0000         1
..    ...     ...     ...      ...       ...
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1
883  28.0    male  Second  10.5000         0
886  27.0    male  Second  13.0000         0

[184 rows x 5 columns]>


* key: Third
* number: 491
<bound method NDFrame.head of       age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns]>


              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0
* key: ('First', 'female')
* number: 94
<bound method NDFrame.head of       age     sex  class      fare  survived
1    38.0  female  First   71.2833         1
3    35.0  female  First   53.1000         1
11   58.0  female  First   26.5500         1
31    NaN  female  First  146.5208         1
52   49.0  female  First   76.7292         1
..    ...     ...    ...       ...       ...
856  45.0  female  First  164.8667         1
862  48.0  female  First   25.9292         1
871  47.0  female  First   52.5542         1
879  56.0  female  First   83.1583         1
887  19.0  female  First   30.0000         1

[94 rows x 5 columns]>


* key: ('First', 'male')
* number: 122
<bound method NDFrame.head of       age   sex  class      fare  survived
6    54.0  male  First   51.8625         0
23   28.0  male  First   35.5000         1
27   19.0  male  First  263.0000         0
30   40.0  male  First   27.7208         0
34   28.0  male  First   82.1708         0
..    ...   ...    ...       ...       ...
839   NaN  male  First   29.7000         1
857  51.0  male  First   26.5500         1
867  31.0  male  First   50.4958         0
872  33.0  male  First    5.0000         0
889  26.0  male  First   30.0000         1

[122 rows x 5 columns]>


* key: ('Second', 'female')
* number: 76
<bound method NDFrame.head of       age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
41   27.0  female  Second  21.0000         0
43    3.0  female  Second  41.5792         1
53   29.0  female  Second  26.0000         1
..    ...     ...     ...      ...       ...
854  44.0  female  Second  26.0000         0
865  42.0  female  Second  13.0000         1
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1

[76 rows x 5 columns]>


* key: ('Second', 'male')
* number: 108
<bound method NDFrame.head of       age   sex   class  fare  survived
17    NaN  male  Second  13.0         1
20   35.0  male  Second  26.0         0
21   34.0  male  Second  13.0         1
33   66.0  male  Second  10.5         0
70   32.0  male  Second  10.5         0
..    ...   ...     ...   ...       ...
848  28.0  male  Second  33.0         0
861  21.0  male  Second  11.5         0
864  24.0  male  Second  13.0         0
883  28.0  male  Second  10.5         0
886  27.0  male  Second  13.0         0

[108 rows x 5 columns]>


* key: ('Third', 'female')
* number: 144
<bound method NDFrame.head of       age     sex  class     fare  survived
2    26.0  female  Third   7.9250         1
8    27.0  female  Third  11.1333         1
10    4.0  female  Third  16.7000         1
14   14.0  female  Third   7.8542         0
18   31.0  female  Third  18.0000         0
..    ...     ...    ...      ...       ...
863   NaN  female  Third  69.5500         0
875  15.0  female  Third   7.2250         1
882  22.0  female  Third  10.5167         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0

[144 rows x 5 columns]>


* key: ('Third', 'male')
* number: 347
<bound method NDFrame.head of       age   sex  class     fare  survived
0    22.0  male  Third   7.2500         0
4    35.0  male  Third   8.0500         0
5     NaN  male  Third   8.4583         0
7     2.0  male  Third  21.0750         0
12   20.0  male  Third   8.0500         0
..    ...   ...    ...      ...       ...
877  19.0  male  Third   7.8958         0
878   NaN  male  Third   7.8958         0
881  33.0  male  Third   7.8958         0
884  25.0  male  Third   7.0500         0
890  32.0  male  Third   7.7500         0

[347 rows x 5 columns]>


                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447


<class 'pandas.core.frame.DataFrame'>

NameError: name 'group3f' is not defined

## 그룹 연산 메소드(적용-결합 단계)

### 예제 6-15. 데이터집계

In [44]:
#라이브러리 불러오기
import pandas as pd
import seaborn as sns

#titanic 데이터셋에서 age,sex 등 5개의 열을 선택하여 데이터프레임 만들기
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','sex','class','fare','survived']]

#class 열을 기준으로 분할
grouped=df.groupby(['class'])

#각 그룹에 대한 모든 열의 표준편차를 집계하여 데이터프레임으로 변환
std_all=grouped.std()
print(std_all)
print('\n')
print(type(std_all))
print('\n')

#각 그룹에 대한 fare 열이 표준편차를 집계하여 시리즈로 변환
std_fare=grouped.fare.std()
print(std_fare)
print('\n')
print(type(std_fare))

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949


<class 'pandas.core.frame.DataFrame'>


class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64


<class 'pandas.core.series.Series'>